app/controllers/sprints_controller.rb

SELECT * FROM `sprints` ORDER BY number_of_days DESC
---
  def index
    @sprints = Sprint.all

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
---
  def show
    @sprint = Sprint.find(params[:id])

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
---
  def edit
    @sprint = Sprint.find(params[:id])

INSERT INTO `sprints` (`start_date`, `number_of_days`, `created_at`, `title`, `theme`, `updated_at`, `end_date`) VALUES('2009-10-31 18:38:00', NULL, '2009-10-31 18:38:39', 'Test sprint', 'testing', '2009-10-31 18:38:39', '2009-12-01 18:38:00')
---
  def create
    @sprint = Sprint.new(params[:sprint])

    respond_to do |format|
      if @sprint.save

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
UPDATE `sprints` SET `updated_at` = '2009-11-02 03:31:58', `start_date` = '2009-10-31', `end_date` = '2009-10-31', `number_of_days` = 0 WHERE `id` = 2
---
  def update
    @sprint = Sprint.find(params[:id])

    respond_to do |format|
      if @sprint.update_attributes(params[:sprint])

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 3)
DELETE FROM `sprints` WHERE `id` = 3
---
  def destroy
    @sprint = Sprint.find(params[:id])
    @sprint.destroy

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
---
  def workload
    @sprint = Sprint.find(params[:id])

SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
---
  def burndown
    @sprint = Sprint.find(params[:id])

SELECT * FROM `cells` WHERE (`cells`.task_id = 7) ORDER BY day ASC
UPDATE `cells` SET `updated_at` = '2009-11-03 03:35:47', `hours` = 5 WHERE `id` = 55
---
  def update_cell
    @cell = Cell.find(params[:id])
    @target  = params[:value]
    @cell.hours = @target
    @cell.save