app/controllers/tasks_controller.rb

  def index
    sort =  case params[:sort]
            when "title"  then "title"
            when "started"   then "started"
            when "done" then "done"
            when "initial_estimate" then "initial_estimate"
            when "title_reverse"  then "title DESC"
            when "started_reverse"   then "started DESC"
            when "done_reverse" then "done DESC"
            when "initial_estimate_reverse" then "initial_estimate DESC"
            end

    @tasks = Task.all :order => sort
---
SELECT * FROM `tasks` ORDER BY initial_estimate

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def new
    @task = Task.new
    @sprint = Sprint.find(params[:id])
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)

  def edit
    @task = Task.find(params[:id])
    @sprint = Sprint.find(@task.sprint_id)
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)

  def create
    @task = Task.new(params[:task])
    @sprint = Sprint.find(@task.sprint_id)

    respond_to do |format|
      if @task.save
---
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
INSERT INTO `tasks` (`sprint_id`, `created_at`, `title`, `updated_at`, `found`, `done`, `started`, `initial_estimate`, `user_id`, `high_estimate`, `low_estimate`) VALUES(1, '2009-11-02 20:58:50', 'lalala', '2009-11-02 20:58:50', NULL, NULL, NULL, 15, NULL, 16, 13)

  def update
    @task = Task.find(params[:id])
    @sprint = Sprint.find(@task.sprint_id)

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
SELECT * FROM `sprints` WHERE (`sprints`.`id` = 1)
UPDATE `tasks` SET `initial_estimate` = 2, `updated_at` = '2009-11-02 15:56:00', `high_estimate` = 3 WHERE `id` = 10

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1